# 4. Напишите программу, которая будет преобразовывать 
# десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

dvoichnoe = ""
n = int(input("Введите число: "))
while n != 0:
    dvoichnoe = str(n%2) + dvoichnoe
    n //=2
print(dvoichnoe)